Revit 2027 API
FabricWireItem.WireType Property
 The wire type of this wire item
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId WireType { get; set; }
Public Property WireType As ElementId
	Get
	Set
public:
property ElementId^ WireType {
	ElementId^ get ();
	void set (ElementId^ value);
}
member WireType : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: wireType is not a valid Element identifier.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
FabricWireItem Class
Autodesk.Revit.DB.Structure Namespace